app/views/teams/index.html.erb

SELECT "articles".* FROM "articles"
---
  window.articlesURL = '<%= j articles_url %>';
  window.articles = <%= raw Article.all.to_json %>

SELECT "teammates".* FROM "teammates" WHERE "teammates"."team_id" = ?  [["team_id", 1]]
SELECT "teams".* FROM "teams"
---

	<%team.teammates.each do |tm|%>