ruslan/app/views/teams/addel.html.erb


	<%team.teammates.each do |tm|%>
---
SELECT "teammates".* FROM "teammates" WHERE "teammates"."team_id" = ?  [["team_id", 29]]
SELECT "teams".* FROM "teams"