ruslan/app/views/teams/index.html.erb

	<%qw = 0%>
	<%team.teammates.each do |tm|%>
---
SELECT "teammates".* FROM "teammates" WHERE "teammates"."team_id" = ?  [["team_id", 1]]
SELECT "teams".* FROM "teams"