app/controllers/teams_controller.rb

SELECT  "teams".* FROM "teams" WHERE "teams"."id" = ? LIMIT 1  [["id", 1]]
DELETE FROM "teams" WHERE "teams"."id" = ?  [["id", 1]]
---
	def destroy
  	  @team = Team.find(params[:id])
  	  @team.destroy

INSERT INTO "teams" ("name_team", "created_at", "updated_at") VALUES (?, ?, ?)  [["name_team", "вторая команда"], ["created_at", "2016-03-15 21:16:45.572824"], ["updated_at", "2016-03-15 21:16:45.572824"]]
INSERT INTO "managers" ("name", "univercity", "kontakts", "team_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["name", "uhbuf"], ["univercity", "qwepetrsu"], ["kontakts", "1231"], ["team_id", 25], ["created_at", "2016-03-16 16:28:28.180491"], ["updated_at", "2016-03-16 16:28:28.180491"]]
INSERT INTO "teammates" ("name", "level", "team_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["name", "Ермолин никола"], ["level", "12"], ["team_id", 14], ["created_at", "2016-03-15 21:29:03.831100"], ["updated_at", "2016-03-15 21:29:03.831100"]]
---
	def create

	   @team = Team.new(teamparams)
	   @team.save
	   loc = params[:team][:manager]
	   @team.create_manager(name: loc[:name], univercity: loc[:univercity], kontakts: loc[:kontakts], position: loc[:position])

	   params[:team][:teammate].each{|teammate|
    	     @team.teammates.create(name: teammate[:name], level: teammate[:level])