ruslan/app/controllers/articles_controller.rb

SELECT "articles".* FROM "articles"
---
  def addel
    @articles = Article.all

INSERT INTO "articles" ("title", "text", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "МОё первое руби"], ["text", "Это кароче вообще тема!!!!!!"], ["created_at", "2015-12-29 21:27:29.331072"], ["updated_at", "2015-12-29 21:27:29.331072"]]
INSERT INTO "pictures" ("image_file_name", "image_content_type", "image_file_size", "image_updated_at", "article_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)
---
  def create
   @article = Article.new(article_params)

    respond_to do |format|
      if @article.save

        if params[:images]
          # The magic is here ;)
          params[:images].each { |image|
            @article.pictures.create(image: image)