ruslan/app/controllers/teams_controller.rb

SELECT "teams".* FROM "teams"
---
	def addel
		@teams = Team.all

SELECT "teams".* FROM "teams"
---
	def show
		@teams = Team.all

SELECT  "teams".* FROM "teams" WHERE "teams"."id" = ? LIMIT 1  [["id", 1]]
DELETE FROM "teams" WHERE "teams"."id" = ?  [["id", 1]]
---
	def destroy
  	  @team = Team.find(params[:id])
  	  @team.destroy

SELECT  "teams".* FROM "teams" WHERE "teams"."id" = ? LIMIT 1  [["id", 29]]
UPDATE "teams" SET "check" = ?, "updated_at" = ? WHERE "teams"."id" = ?  [["check", "t"], ["updated_at", "2016-03-16 21:54:32.032044"], ["id", 29]]
---
	def update
		@team = Team.find(params[:id])
		@team.update(teamparams)

INSERT INTO "managers" ("name", "univercity", "kontakts", "team_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["name", "uhbuf"], ["univercity", "qwepetrsu"], ["kontakts", "1231"], ["team_id", 25], ["created_at", "2016-03-16 16:28:28.180491"], ["updated_at", "2016-03-16 16:28:28.180491"]]
INSERT INTO "teammates" ("name", "level", "team_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["name", "Ермолин никола"], ["level", "12"], ["team_id", 14], ["created_at", "2016-03-15 21:29:03.831100"], ["updated_at", "2016-03-15 21:29:03.831100"]]
INSERT INTO "teams" ("name_team", "message", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name_team", "Втора"], ["message", "КАкие скидки????"], ["created_at", "2016-03-17 15:41:51.440391"], ["updated_at", "2016-03-17 15:41:51.440391"]]
---
	def create

	   qw = 1;
	   if qw == 0
	      @team = Team.new(teamparams,check: false)
	      6.times { @team.teammates.build}
	      @team.build_manager;
	      @team.manager.name = "rhzhzzzzzzzzz";
	      render 'new';
	      return;
	   end
	   @team = Team.new(teamparams,check: false)
	   @team.save